#Задание 3
temperature = float(input('Введите температуру в градусах цельсия:'))
if temperature > 25:
    print('На улице жарко рекомендуется одень лёгкую одежду')
elif temperature <= 10:
    print(' Погода прохладная лучше одеть кофту')
else:
    print('Холодно,не забудте одется потеплее')
    
#Задание 2
variable = -5
if variable > 0:
    print('Значение переменной больше 0')
    print(1)
else:
     print('Значение переменной меньше или равно 0')
     print(-1)
     
#Задание 1
variable = -1
if variable > 0:
    print('Значение переменной больше 0')
else:
     print('Значение переменной меньше или равно 0')



    
    

    



